{
  "portfolio": [
    {
      "title": "Camelcase.in",
      "description": "Camelcase is a team of developers who will help you build applications using advanced frameworks with minimal footprint. Ready to build using React, Angular, Ionic, Spring, Django, MongoDB or whatever you prefer.",
      "image": "/portfolio/camelcase.png",
      "link": "https://camelcase.in",
      "tech": ["rt", "ts", "gtpy", "gql", "chk"]
    },
    {
      "title": "Riceandricecalicut.com",
      "description": "Rice & Rice Calicut is acknowledged for providing high-quality rice making use of superior grade rice as inputs. With expert done selection of types of rices, they work with a team of deft professionals who manage the entire task proficiently and lay special emphasis on product packaging so as to ensure no damage till it reaches the end-user with affordable pricing.",
      "image": "/portfolio/rice-and-rice.png",
      "link": "https://riceandrice.netlify.app",
      "tech": ["bstrp", "js", "css"]
    },
    {
      "title": "Zealacademy.info",
      "description": "Zeal Academy is one of the emerging preeminent institution for pharmacy graduates who are aiming to build a healthcare career abroad. They are committed in nurturing dreams of becoming a part of healthcare foreign jobs with comprehensive education services. They are creating new, radical and certifying opportunities that helps students recognize the accurate path of accomplishment that helps as the springboard for their future career.",
      "image": "/portfolio/zeal-academy.png",
      "link": "https://zealacademy.info",
      "tech": ["rt", "ts", "tw"]
    },
    {
      "title": "Mission KAS",
      "description": "Zeal Academy provides smart and focused training to the aspirants to succeed in the KAS examination.",
      "image": "/portfolio/mission-kas.png",
      "link": "https://missionkas.com",
      "tech": ["rt", "ts", "tw"]
    },
    {
      "title": "Cochincarrental.com",
      "description": "A sister concern of Series tours, Cochin car rental is one of the leading Kerala Tour Operators - engaged in the promotion of Kerala Tourism. They focus on providing customers with the best car rental and tour package they can enjoy inside of Kerala. With a fleet of trained drivers, highly maintained vehicles and exceptional customer service, they have become one of the best taxi services in Kerala.",
      "image": "/portfolio/cochin-car-rental.png",
      "link": "https://cochincarrental.com",
      "tech": ["rt", "ts", "gtpy", "gql", "tw"]
    }
  ]
}
